In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
x = np.random.randint(1,6,10)
y = np.array(['Baahubali','Fukrey','Sultan','Dangal','Tubelight',
              'Tiger','PK','Dhoom','ABCD','ABCD2'])

In [3]:
data = {
    'Rating' : x,
    'Movie_Name' : y
}

s = pd.Series(data)

In [4]:
s

Movie_Name    [Baahubali, Fukrey, Sultan, Dangal, Tubelight,...
Rating                           [1, 5, 2, 4, 3, 5, 2, 4, 4, 5]
dtype: object

In [5]:
s1 = pd.Series(y)

In [6]:
s1

0    Baahubali
1       Fukrey
2       Sultan
3       Dangal
4    Tubelight
5        Tiger
6           PK
7        Dhoom
8         ABCD
9        ABCD2
dtype: object

In [7]:
s1 = pd.Series(y, index=x)

In [8]:
s1

1    Baahubali
5       Fukrey
2       Sultan
4       Dangal
3    Tubelight
5        Tiger
2           PK
4        Dhoom
4         ABCD
5        ABCD2
dtype: object

In [10]:
s1 = pd.Series(y, index=x, name='Ratings')

In [11]:
s1

1    Baahubali
5       Fukrey
2       Sultan
4       Dangal
3    Tubelight
5        Tiger
2           PK
4        Dhoom
4         ABCD
5        ABCD2
Name: Ratings, dtype: object

In [12]:
df = pd.DataFrame(data)

In [13]:
df

  Movie_Name  Rating
0  Baahubali       1
1     Fukrey       5
2     Sultan       2
3     Dangal       4
4  Tubelight       3
5      Tiger       5
6         PK       2
7      Dhoom       4
8       ABCD       4
9      ABCD2       5

In [15]:
s1[0:5]

1    Baahubali
5       Fukrey
2       Sultan
4       Dangal
3    Tubelight
Name: Ratings, dtype: object

In [18]:
s1[1]

'Baahubali'

In [20]:
s1[2]

2    Sultan
2        PK
Name: Ratings, dtype: object

In [22]:
s1[3]

'Tubelight'

In [26]:
df['Movie_Name']

0    Baahubali
1       Fukrey
2       Sultan
3       Dangal
4    Tubelight
5        Tiger
6           PK
7        Dhoom
8         ABCD
9        ABCD2
Name: Movie_Name, dtype: object

In [27]:
df[0:5]

  Movie_Name  Rating
0  Baahubali       1
1     Fukrey       5
2     Sultan       2
3     Dangal       4
4  Tubelight       3

In [30]:
df[df['Movie_Name'] == 'Baahubali']

  Movie_Name  Rating
0  Baahubali       1

In [33]:
df['Movie_Name'][0] = 'Baahubali 2'

C:\Users\asus\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [34]:
df

    Movie_Name  Rating
0  Baahubali 2       1
1       Fukrey       5
2       Sultan       2
3       Dangal       4
4    Tubelight       3
5        Tiger       5
6           PK       2
7        Dhoom       4
8         ABCD       4
9        ABCD2       5

In [35]:
df[df['Rating'] == 5]

  Movie_Name  Rating
1     Fukrey       5
5      Tiger       5
9      ABCD2       5